
from PyQt5.QtWidgets import ( QWidget, QVBoxLayout,  QTextBrowser)


class BioWindow(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Γενικές Οδηγίες")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html = """
        <html>
        <head>
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
        </head>
        <body>
            <h1 style="color:blue;">Γενικές Οδηγίες</h1>
            <p align="center">Η εφαρμογή υλοποιήθηκε για την υποβοήθηση του έργου του Αξιωματικού Υπηρεσίας και την
            τάχιστη περαίωση των αυτοφώρων και μηνύσεων με σκοπό την εξοικονομηση χρόνου.</p> 
        
             <p><strong>Γενικές Οδηγίες</strong> 
             <ol>
             <li style="color:blue;">Στη μήνυση κατά αγνώστου με σωματικές βλάβες θα πρέπει να διορθώνεται στο 
               word κείμενο τόσο στην Έκθεση Ενορκης Εξέτασης, όσο και στην ιατροδικαστική, στο ΒΑΣ και στο διαβιβαστικό 
               καθώς στο Επώνυμο περνιέται ο άγνωστος δράστης και να σβήνονται τα του  και της   γεν.  στη  κατ.
               ,αριθμός τηλεφώνου , ηλεκτρονικό  ταχυδρομείου, Α.Φ.Μ : , Δ.Ο.Υ :< </li>
             <li style="color:blue;">Αν θελει ο χρήστης για τη βέλτιστη περαίωση ενός αυτοφώρου να απαντήσει άμεσα σε 
             όλες τις ερωτήσεις. Τότε η εφαρμογή θα δημιουργήσει όλα τα απαραίτητα έγγραφα απευθείας και θα είναι μόνο
              για  έλεγχο και υπογραφή. Μπορεί όμως να απαντήσει μόνο στις ερωτήσεις που αφορούν την Έκθεση Ένορκης 
              Εξέτασης Μάρτυρα να πατήσει το κουμπί δημιουργία εγγράφων ώστε να δημιουργηθεί η ανωτέρω έκθεση και αφού
              υπαγράψουν τα εμπλεκόμενα άτομα, να συνεχίσει με τις άλλες ερωτήσεις. Τα άλλα έγγραφα θα δημιουργηθούν 
              και αυτά κενά στην αρχή και στην συνέχεια θα συμπληρωθούν με τις απαραίτητες απαντήσεις.</li>
             
             </ol>
            
           </p>
         
            <p><strong>Επικοινωνία:</strong> g.athanasidis@astynomia.gr</p>
        </body>
        </html>
        """
        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)