from PyQt5.QtWidgets import (QWidget, QVBoxLayout,  QTextBrowser)


class GunLaw(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Νομοθεσία Περί Όπλων και Εκρηκτικών - 2168/93")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html="""
        <html>
        <head> 
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
            </head>
            <body>
                <h1 style="color:blue;">Νόμος περί όπλων και εκρηκτικών 2168/93</h1>
                <p align="center">Άρθρο 1. Έννοια όρων - Έκταση εφαρμογής</p>
                <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">
                1. Για την εφαρμογή του παρόντος νόμου:</span>
                <br>α. Όπλο είναι κάθε μηχάνημα, το οποίο, με ωστική δύναμη που παράγεται με οποιονδήποτε 
                 τρόπο, εκτοξεύει βλήμα ή χημικές ουσίες ή ακτίνες ή φλόγες  ή αέρια και μπορεί να επιφέρει κάκωση ή
                  βλάβη της υγείας σε πρόσωπα ή βλάβη σε πράγματα ή να προκαλέσει πυρκαγιά και ιδίως κάθε πυροβόλο όπλο,
                   χειροβομβίδα και νάρκη κάθε τύπου, όπως και κάθε συσκευή που μπορεί να προκαλέσει με οποιονδήποτε 
                   τρόπο τα ανωτέρω αποτελέσματα. 
                <br> β. Κυνηγετικά όπλα είναι τα επωμιζόμενα μονόκανα και δίκανα,
                 επαναληπτικά και ημιαυτόματα όπλα, που έχουν το εσωτερικό της κάνης τους λείο και όχι ραβδωτό, μήκος
                  κάνης τουλάχιστον πενήντα εκατοστών του μέτρου και συνολικό μήκος τουλάχιστον ενός (1) μέτρου, 
                  σταθερό, μη πτυσσόμενο κοντάκι, λειτουργούν με δύναμη που παράγεται από την καύση πυρίτιδας,
                   προορίζονται αποκλειστικά και μόνο για την άσκηση θήρας ή εξάσκηση στη σκοποβολή, φέρουν συνολικά
                    μέχρι τρία φυσίγγια και δεν δύναται να δεχθούν περισσότερα από τρία φυσίγγια. Τα όπλα αυτά 
                    κατατάσσονται σε δύο κατηγορίες Α και Β. Στην κατηγορία Α υπάγονται όσα έχουν κάνη μήκους μέχρι 60
                     εκατοστών και στην κατηγορία Β τα λοιπά κυνηγετικά όπλα, στα οποία περιλαμβάνονται και λειόκανα 
                     όπλα μικρού διαμετρήματος τύπου FLOBERT. 
                <br> γ. Αεροβόλα είναι τα όπλα που λειτουργούν με συμπιεσμένο αέρα ή με χρήση
                 διοξειδίου του άνθρακα και εκτοξεύουν σφαιρίδιο από μεταλλική, πλαστική ή άλλη ύλη.
                <br>δ.Πυρομαχικά είναι τα πάσης φύσεως εφόδια βολής, ιδίως τα φυσίγγια
                 πολεμικών τυφεκίων, αυτομάτων, πολυβόλων, πιστολιών και περιστρόφων, τα βλήματα βαρέων όπλων και 
                 πυροβολικού, καθώς και τα συστήματα, που αποτελούνται από εκρηκτικές ύλες, εκρηκτικούς μηχανισμούς ή 
                 συνδυασμούς αυτών, τα οποία μπορούν να χρησιμοποιηθούν όπως είναι ή να βληθούν με όπλα ευθυτενούς ή 
                 καμπύλης τροχιάς. Στην έννοια των πυρομαχικών περιλαμβάνονται και τα ενεργά επί μέρους στοιχεία αυτών 
                 (καψύλλια, κάλυκες, βολίδες, βραδύκαυστα υλικά κ.λπ.), καθώς και τα φυσίγγια βλαπτικών χημικών ουσιών.
                 <br>ε. Εκρηκτικές ύλες είναι τα στερεά ή υγρά σώματα, τα οποία από 
                 οποιαδήποτε αιτία υφίστανται χημική μεταβολή και μετατρέπονται σε αέριες μάζες με συνθήκες υψηλών 
                 θερμοκρασιών και πιέσεων, με αποτελέσματα βλητικά ή ρηκτικά.  
                <br>στ. Εκρηκτικός μηχανισμός είναι κάθε συσκευή, που μπορεί να προκαλέσει 
                έκρηξη οποιασδήποτε εκρηκτικής ύλης. </p>
                 <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">'Όπλα θεωρούνται επίσης τα 
                αντικείμενα που είναι πρόσφορα για επίθεση ή άμυνα και ιδιαίτερα:</span>
                <br>α. Μηχανισμοί και κάθε μέσο εκτόξευσης χημικών ουσιών (SPRAY) ή εκκένωσης ηλεκτρικής ενέργειας.
                <br>β. Μαχαίρια κάθε είδους, εκτός εκείνων που η κατοχή τους δικαιολογείται για οικιακή ή επαγγελματική
                    ή εκπαιδευτική χρήση, τέχνη, θήρα, αλιεία ή άλλη συναφή χρήση.
                <br>γ. Μεταλλικές γροθιές, ρόπαλα μεταλλικά ή μη, και ρόπαλα συνδεδεμένα με αλυσίδα ή σχοινί (νουτσάκο).
                <br>δ. Σπάθες, λόγχες, ξίφη, ξιφίδια, ξιφολόγχες, στιλέτα, τόξα, βαλλίστρες (ARBALETE) και αστυνομικές
                 ράβδοι.
                <br>ε. Αντικείμενα ή μέσα που χρησιμοποιούνται για εκτόξευση ουσιών που αναφλέγονται αυτόματα ή 
                περιέχουν αναισθησιογόνα ή ερεθιστικές χημικές ουσίες και προορίζονται για επίθεση ή άμυνα.
                <br>στ. Τυφέκια αλιείας (ψαροτούφεκα), που εκτοξεύουν αιχμηρό μεταλλικό αντικείμενο (καμάκι)</p>
                <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">
                3. Στις διατάξεις του παρόντος νόμου υπάγονται επίσης:</span><br>
                α. Σιγαστήρες, που τοποθετούνται σε οποιοδήποτε όπλο.<br>
                β. Συσκευές ή εγκαταστάσεις, που προορίζονται για το φωτισμό του στόχου ή του σκοπεύτρου του όπλου.<br>
                γ. Σκοπευτικές διόπτρες όπλων και πάσης φύσεως σκόπευτρα, ως και εξομοιωτές σκοποβολής.<br>
                δ. Ανταλλακτικά, μέρη και εξαρτήματα όπλων και εκρηκτικών μηχανισμών, ως και μέρη πυρομαχικών.<br>
                ε. Απομιμήσεις (REPLICA) πυροβόλων όπλων, εφόσον αυτές είναι δυνατό να μετατραπούν σε πραγματικά όπλα, 
                ως και μη λειτουργούντα, λόγω ουσιώδους έλλειψης ή βλάβης, πυροβόλα όπλα.</p>
                <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">
                4. Τα πυροβόλα όπλα διακρίνονται σε αυτόματα, ημιαυτόματα και επαναληπτικά:</span><br>
                α. Αυτόματο είναι το πυροβόλο όπλο, το οποίο μετά από κάθε βολή οπλίζεται μόνο του και μπορεί να βάλλει
                 με ριπές κάθε φορά που πιέζεται η σκανδάλη του.<br>
                β. Ημιαυτόματο είναι το πυροβόλο όπλο, το οποίο μετά από κάθε βολή οπλίζεται μόνο του αλλά, κάθε φορά 
                που πιέζεται η σκανδάλη του, εκτοξεύει ένα μόνο βλήμα.<br>
                γ. Επαναληπτικό είναι το πυροβόλο όπλο, το οποίο μετά από κάθε βολή οπλίζεται με τη βοήθεια χειροκίνητου
                 μηχανισμού.<br></p>
                <p><span style="text-align: justify>
                5.</span> α. Ως όπλα σκοποβολής θεωρούνται τα όπλα που καθορίζονται με απόφαση των Υπουργών Πολιτισμού 
                και Δημόσιας Τάξης.<br>
                   β. Δεν θεωρούνται όπλα τα πιστόλια αφέσεως αγώνων, που κατασκευάζονται ειδικά να χρησιμοποιηθούν για 
                   το σκοπό αυτόν. </p>
                <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">
                6. Δεν εμπίπτουν στις διατάξεις του παρόντος νόμου:</span><br>
                    α. Πυροβόλα όπλα, που κατασκευάστηκαν πριν από την 1.1.1870, υπό τον όρο ότι δεν μπορούν να δεχθούν 
                    πυρομαχικά προοριζόμενα για όπλα, η κατοχή των οποίων απαιτεί άδεια.<br>
                    β. Αγχέμαχα όπλα, που κατασκευάστηκαν πριν από την 1.1.1922, εφόσον φυλάσσονται σε ειδικά 
                    καταστήματα εμπορίας ή σε συλλογές φυσικών ή νομικών προσώπων".</p>
                <p align="center">Άρθρο 7. Κατοχή </p>
                <p>1. Η κατοχή όπλων και λοιπών αντικειμένων, που διαλαμβάνονται στο άρθρο 1 του παρόντος νόμου, απαγορεύεται, εκτός των περιπτώσεων που προβλέπονται από τις διατάξεις του νόμου αυτού. 
2. Με άδεια της αρμόδιας αστυνομικής αρχής του τόπου κατοικίας του ενδιαφερόμενου, επιτρέπεται η κατοχή : 
α. Πιστολών, περιστρόφων και των ουσιωδών μερών (μηχανισμού κλείστρου, θαλάμης, κάνης) και φυσιγγίων αυτών. 
β. Εκρηκτικών υλών και εκρηκτικών μηχανισμών. 
γ. Των αναφερόμενων στο άρθρο 2 παρ. 2 παρ. γ' ειδών. 
δ. Όπλων ή άλλων αντικειμένων του άρθρου 1, που προορίζονται για δείγματα ή εκθέσεις, σύμφωνα με τα καθοριζόμενα στην απόφαση, που προβλέπεται από την περίπτωση η' της παραγράφου 2 του άρθρου 2 του παρόντος. 
ε. Όπλων σκοποβολής και ουσιωδών μερών (μηχανισμού κλείστρου, θαλάμης, κάνης) και φυσιγγίων αυτών, καθώς και σκοπευτικών διοπτρών. Η άδεια κατοχής των όπλων αυτών χορηγείται σε φυσικά ή νομικά πρόσωπα, που ασχολούνται αποδεδειγμένα με την προαγωγή του αθλήματος της σκοποβολής. Οι προϋποθέσεις χορήγησης της άδειας κατοχής όπλων σκοποβολής, οι υποχρεώσεις των ενδιαφερόμενων, ο αριθμός των όπλων που επιτρέπεται να κατέχει κάθε φυσικό ή νομικό πρόσωπο και κάθε άλλη αναγκαία λεπτομέρεια, ρυθμίζονται με απόφαση των Υπουργών Πολιτισμού και Δημόσιας Τάξης. 
στ. Αυτόματων όπλων και φυσιγγίων αυτών, που προβλέπονται στις περιπτώσεις του άρθρου 6 παρ. 2 του παρόντος. 
ζ. Των αναφερόμενων στο άρθρο 2, παράγρ. 2 περιπτ. θ' και ι' και 3, όπλων και λοιπών αντικειμένων. 
η. Τόξων και βαλλιστρών προοριζομένων αποκλειστικά και μόνο για σκοποβολή. 
θ. Όπλων και ανενεργών φυσιγγίων αυτών, που αποτελούν ιστορικά ή οικογενειακά κειμήλια ή παρουσιάζουν ιστορικό, αρχαιολογικό ή εθνογραφικό ενδιαφέρον και φυλάσσονται σε συλλογές φυσικών ή νομικών προσώπων. 
3. Για την κατοχή αεροβόλων όπλων και τυφεκίων αλιείας δεν απαιτείται άδεια. Απαγορεύεται η κατοχή τους από άτομα που δεν έχουν συμπληρώσει το 18ο έτος της ηλικίας τους. 
4. Η κατοχή λογχών, ξιφών, ξιφιδίων και ξιφολογχών, απομιμήσεων πυροβόλων όπλων, ως και μη λειτουργούντων πυροβόλων όπλων επιτρέπεται: 
α. Σε πρόσωπα που έχουν άδεια κατοχής όπλων προοριζομένων για συλλογές. 
β. Σε παραγωγούς θεατρικών ή κινηματογραφικών έργων 
5. Δεν απαιτείται άδεια για μαχαίρια, που προορίζονται για αλιεία, θήρα, τέχνη ή οικιακή, επαγγελματική ή άλλη συναφή χρήση, για μηχανισμούς εκτοξεύσεως χημικών ουσιών, που προορίζονται για την ίδια χρήση, ως και για ξίφη και σπάθες που χρησιμοποιούνται για άθληση. 
6. Οι κάτοχοι των ειδών, που αναφέρονται στο άρθρο αυτό, υποχρεούνται να λαμβάνουν τα αναγκαία μέτρα για την ασφαλή φύλαξή τους και να μην παραχωρούν αυτό σε τρίτα πρόσωπα. Οι αρμόδιες αστυνομικές αρχές δύνανται να υποδεικνύουν εγγράφως στους ενδιαφερόμενους τη λήψη των κατά την κρίση τους επιβαλλόμενων μέτρων ασφαλείας. 
7. Όποιος βρίσκει αντικείμενο από τα αναφερόμενα στο άρθρο 1 του παρόντος υποχρεούται να το παραδώσει αμέσως στην πλησιέστερη αστυνομική αρχή ή να ειδοποιήσει αυτή για την παραλαβή του. 
8. α. Με φυλάκιση τουλάχιστον έξι (6) μηνών και χρηματική ποινή τουλάχιστον διακοσίων χιλιάδων (200.000) δραχμών τιμωρούνται οι παραβάτες των παραγράφων 1 και 2, πλην της περιπτ. η' του παρόντος άρθρου. Με την ίδια ποινή τιμωρείται όποιος μετατρέπει ή παραλλάσσει όπλο από τα αναφερόμενα στο άρθρο 1, παράγρ. 1 περιπτ. α' και β' ή απαλείφει ή παραποιεί τον αριθμό του, για οποιονδήποτε σκοπό. 
β. Με φυλάκιση μέχρις ενός (1) έτους τιμωρούνται οι παραβάτες των διατάξεων των παραγράφων 2, περίπτ. η' 3, 4 και 6 του παρόντος άρθρου. 
γ. Οι παραβάτες των διατάξεων της παραγράφου 7 τιμωρούνται με φυλάκιση μέχρι έξι (6) μηνών και, σε περίπτωση που αποσκοπούν σε κατακράτηση των ανευρεθέντων αντικειμένων, με τις ποινές των προηγούμενων εδαφίων, ανάλογα με το είδος του ανευρεθέντος αντικειμένου. 
 
</p>

            </body>
        </html>
        """
        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)


class CourtOrder(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Άρθρο 169Α Π.Κ  - Παραβίαση δικαστικών αποφάσεων και συμφωνιών που επικυρώθηκαν"
                            " από συμβολαιογράφο")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html="""
             <html>
        <head> 
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
            </head>
            <body>
             <h1 style="color:blue; align=center">Άρθρο 169Α Π.Κ  - Παραβίαση δικαστικών αποφάσεων και συμφωνιών που επικυρώθηκαν"
                            " από συμβολαιογράφο</h1>
            <p align: justify;>1. Όποιος δεν συμμορφώθηκε σε προσωρινή διαταγή ή διάταξη δικαστικής απόφασης πολιτικού δικαστηρίου ή 
            σε εισαγγελική διάταξη, που αφορούν τη ρύθμιση της νομής ή της κατοχής, την άσκηση της γονικής μέριμνας, 
            την επικοινωνία με το τέκνο και τη ρύθμιση της χρήσης της οικογενειακής στέγης και της κατανομής των κινητών
             μεταξύ συζύγων ή την απαγόρευση προσέγγισης και επικοινωνίας μεταξύ προσώπων, τιμωρείται με φυλάκιση έως
              τρία (3) έτη ή χρηματική ποινή. Με την ίδια ποινή τιμωρείται και όποιος δεν συμμορφώθηκε σε συμφωνία που 
              επικυρώθηκε από συμβολαιογράφο κατά το άρθρο 1441 του Αστικού Κώδικα και αφορά στην επικοινωνία των 
              ανήλικων τέκνων.2. Με φυλάκιση έως τρία (3) έτη τιμωρείται ο κατηγορούμενος, ο οποίος παραβιάζει τους 
              περιοριστικούς όρους σχετικά με την ελευθερία κίνησης και διαμονής που του έχουν επιβληθεί με δικαστική 
              απόφαση ή με βούλευμα, μετά τη συμπλήρωση του εκάστοτε ανώτατου ορίου της διάρκειας της προσωρινής 
              κράτησης.3. Όποιος εν γνώσει ματαιώνει την εκτέλεση της ποινής ή του μέτρου ασφαλείας που επιβλήθηκε σε
               άλλον τιμωρείται με φυλάκιση έως τρία (3) έτη ή χρηματική ποινή. Η πράξη μένει ατιμώρητη αν ο υπαίτιος
                την τέλεσε υπέρ κάποιου οικείου του.</p>
            </body>
            </html>
        """

        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)


class ObligationLaw(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Άρθρο 358 Π.Κ  - Παραβίαση της υποχρέωσης διατροφής")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html="""
        <head> 
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
            </head>
            <body>
            <h1 style="color:blue; align=center">Άρθρο 358 Π.Κ  - Παραβίαση της υποχρέωσης διατροφής"</h1>
        
        <p>Όποιος κακόβουλα παραβιάζει την υποχρέωση διατροφής που την επιβάλει σε αυτόν ο νόμος και έχει αναγνωριστεί,
         έστω προσωρινά, με εκτελεστό τίτλο, με τρόπο τέτοιο ώστε ο δικαιούχος να υποστεί στερήσεις ή να αναγκαστεί 
         να δεχτεί την βοήθεια άλλων, τιμωρείται με φυλάκιση έως ένα έτος ή χρηματική ποινή. Για την ποινική δίωξη
          απαιτείται έγκληση. </p>
        """

        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)


