from PyQt5.QtWidgets import (QWidget, QVBoxLayout,  QTextBrowser)


class GunLaw(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Νομοθεσία Περί Όπλων και Εκρηκτικών - 2168/93")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html="""
        <html>
        <head> 
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
            </head>
            <body>
                <h1 style="color:blue;">Νόμος περί όπλων και εκρηκτικών 2168/93</h1>
                <p align="center">Άρθρο 1. Έννοια όρων - Έκταση εφαρμογής</p>
                <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">
                1. Για την εφαρμογή του παρόντος νόμου:</span>
                <br>α. Όπλο είναι κάθε μηχάνημα, το οποίο, με ωστική δύναμη που παράγεται με οποιονδήποτε 
                 τρόπο, εκτοξεύει βλήμα ή χημικές ουσίες ή ακτίνες ή φλόγες  ή αέρια και μπορεί να επιφέρει κάκωση ή
                  βλάβη της υγείας σε πρόσωπα ή βλάβη σε πράγματα ή να προκαλέσει πυρκαγιά και ιδίως κάθε πυροβόλο όπλο,
                   χειροβομβίδα και νάρκη κάθε τύπου, όπως και κάθε συσκευή που μπορεί να προκαλέσει με οποιονδήποτε 
                   τρόπο τα ανωτέρω αποτελέσματα. 
                <br> β. Κυνηγετικά όπλα είναι τα επωμιζόμενα μονόκανα και δίκανα,
                 επαναληπτικά και ημιαυτόματα όπλα, που έχουν το εσωτερικό της κάνης τους λείο και όχι ραβδωτό, μήκος
                  κάνης τουλάχιστον πενήντα εκατοστών του μέτρου και συνολικό μήκος τουλάχιστον ενός (1) μέτρου, 
                  σταθερό, μη πτυσσόμενο κοντάκι, λειτουργούν με δύναμη που παράγεται από την καύση πυρίτιδας,
                   προορίζονται αποκλειστικά και μόνο για την άσκηση θήρας ή εξάσκηση στη σκοποβολή, φέρουν συνολικά
                    μέχρι τρία φυσίγγια και δεν δύναται να δεχθούν περισσότερα από τρία φυσίγγια. Τα όπλα αυτά 
                    κατατάσσονται σε δύο κατηγορίες Α και Β. Στην κατηγορία Α υπάγονται όσα έχουν κάνη μήκους μέχρι 60
                     εκατοστών και στην κατηγορία Β τα λοιπά κυνηγετικά όπλα, στα οποία περιλαμβάνονται και λειόκανα 
                     όπλα μικρού διαμετρήματος τύπου FLOBERT. 
                <br> γ. Αεροβόλα είναι τα όπλα που λειτουργούν με συμπιεσμένο αέρα ή με χρήση
                 διοξειδίου του άνθρακα και εκτοξεύουν σφαιρίδιο από μεταλλική, πλαστική ή άλλη ύλη.
                <br>δ.Πυρομαχικά είναι τα πάσης φύσεως εφόδια βολής, ιδίως τα φυσίγγια
                 πολεμικών τυφεκίων, αυτομάτων, πολυβόλων, πιστολιών και περιστρόφων, τα βλήματα βαρέων όπλων και 
                 πυροβολικού, καθώς και τα συστήματα, που αποτελούνται από εκρηκτικές ύλες, εκρηκτικούς μηχανισμούς ή 
                 συνδυασμούς αυτών, τα οποία μπορούν να χρησιμοποιηθούν όπως είναι ή να βληθούν με όπλα ευθυτενούς ή 
                 καμπύλης τροχιάς. Στην έννοια των πυρομαχικών περιλαμβάνονται και τα ενεργά επί μέρους στοιχεία αυτών 
                 (καψύλλια, κάλυκες, βολίδες, βραδύκαυστα υλικά κ.λπ.), καθώς και τα φυσίγγια βλαπτικών χημικών ουσιών.
                 <br>ε. Εκρηκτικές ύλες είναι τα στερεά ή υγρά σώματα, τα οποία από 
                 οποιαδήποτε αιτία υφίστανται χημική μεταβολή και μετατρέπονται σε αέριες μάζες με συνθήκες υψηλών 
                 θερμοκρασιών και πιέσεων, με αποτελέσματα βλητικά ή ρηκτικά.  
                <br>στ. Εκρηκτικός μηχανισμός είναι κάθε συσκευή, που μπορεί να προκαλέσει 
                έκρηξη οποιασδήποτε εκρηκτικής ύλης. </p>
                 <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">'Όπλα θεωρούνται επίσης τα 
                αντικείμενα που είναι πρόσφορα για επίθεση ή άμυνα και ιδιαίτερα:</span>
                <br>α. Μηχανισμοί και κάθε μέσο εκτόξευσης χημικών ουσιών (SPRAY) ή εκκένωσης ηλεκτρικής ενέργειας.
                <br>β. Μαχαίρια κάθε είδους, εκτός εκείνων που η κατοχή τους δικαιολογείται για οικιακή ή επαγγελματική
                    ή εκπαιδευτική χρήση, τέχνη, θήρα, αλιεία ή άλλη συναφή χρήση.
                <br>γ. Μεταλλικές γροθιές, ρόπαλα μεταλλικά ή μη, και ρόπαλα συνδεδεμένα με αλυσίδα ή σχοινί (νουτσάκο).
                <br>δ. Σπάθες, λόγχες, ξίφη, ξιφίδια, ξιφολόγχες, στιλέτα, τόξα, βαλλίστρες (ARBALETE) και αστυνομικές
                 ράβδοι.
                <br>ε. Αντικείμενα ή μέσα που χρησιμοποιούνται για εκτόξευση ουσιών που αναφλέγονται αυτόματα ή 
                περιέχουν αναισθησιογόνα ή ερεθιστικές χημικές ουσίες και προορίζονται για επίθεση ή άμυνα.
                <br>στ. Τυφέκια αλιείας (ψαροτούφεκα), που εκτοξεύουν αιχμηρό μεταλλικό αντικείμενο (καμάκι)</p>
                <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">
                3. Στις διατάξεις του παρόντος νόμου υπάγονται επίσης:</span><br>
                α. Σιγαστήρες, που τοποθετούνται σε οποιοδήποτε όπλο.<br>
                β. Συσκευές ή εγκαταστάσεις, που προορίζονται για το φωτισμό του στόχου ή του σκοπεύτρου του όπλου.<br>
                γ. Σκοπευτικές διόπτρες όπλων και πάσης φύσεως σκόπευτρα, ως και εξομοιωτές σκοποβολής.<br>
                δ. Ανταλλακτικά, μέρη και εξαρτήματα όπλων και εκρηκτικών μηχανισμών, ως και μέρη πυρομαχικών.<br>
                ε. Απομιμήσεις (REPLICA) πυροβόλων όπλων, εφόσον αυτές είναι δυνατό να μετατραπούν σε πραγματικά όπλα, 
                ως και μη λειτουργούντα, λόγω ουσιώδους έλλειψης ή βλάβης, πυροβόλα όπλα.</p>
                <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">
                4. Τα πυροβόλα όπλα διακρίνονται σε αυτόματα, ημιαυτόματα και επαναληπτικά:</span><br>
                α. Αυτόματο είναι το πυροβόλο όπλο, το οποίο μετά από κάθε βολή οπλίζεται μόνο του και μπορεί να βάλλει
                 με ριπές κάθε φορά που πιέζεται η σκανδάλη του.<br>
                β. Ημιαυτόματο είναι το πυροβόλο όπλο, το οποίο μετά από κάθε βολή οπλίζεται μόνο του αλλά, κάθε φορά 
                που πιέζεται η σκανδάλη του, εκτοξεύει ένα μόνο βλήμα.<br>
                γ. Επαναληπτικό είναι το πυροβόλο όπλο, το οποίο μετά από κάθε βολή οπλίζεται με τη βοήθεια χειροκίνητου
                 μηχανισμού.<br></p>
                <p><span style="text-align: justify>
                5.</span> α. Ως όπλα σκοποβολής θεωρούνται τα όπλα που καθορίζονται με απόφαση των Υπουργών Πολιτισμού 
                και Δημόσιας Τάξης.<br>
                   β. Δεν θεωρούνται όπλα τα πιστόλια αφέσεως αγώνων, που κατασκευάζονται ειδικά να χρησιμοποιηθούν για 
                   το σκοπό αυτόν. </p>
                <p><span style="text-align: justify;color: rgb(117, 117, 117);background-color: rgb(230, 236, 232);
                font-size: 12px;font-family: tahoma, Trebuchet, Arial, Verdana, sans-serif;">
                6. Δεν εμπίπτουν στις διατάξεις του παρόντος νόμου:</span><br>
                    α. Πυροβόλα όπλα, που κατασκευάστηκαν πριν από την 1.1.1870, υπό τον όρο ότι δεν μπορούν να δεχθούν 
                    πυρομαχικά προοριζόμενα για όπλα, η κατοχή των οποίων απαιτεί άδεια.<br>
                    β. Αγχέμαχα όπλα, που κατασκευάστηκαν πριν από την 1.1.1922, εφόσον φυλάσσονται σε ειδικά 
                    καταστήματα εμπορίας ή σε συλλογές φυσικών ή νομικών προσώπων".</p>
                <p align="center">Άρθρο 7. Κατοχή </p>
                <p>1. Η κατοχή όπλων και λοιπών αντικειμένων, που διαλαμβάνονται στο άρθρο 1 του παρόντος νόμου, απαγορεύεται, εκτός των περιπτώσεων που προβλέπονται από τις διατάξεις του νόμου αυτού. 
2. Με άδεια της αρμόδιας αστυνομικής αρχής του τόπου κατοικίας του ενδιαφερόμενου, επιτρέπεται η κατοχή : 
α. Πιστολών, περιστρόφων και των ουσιωδών μερών (μηχανισμού κλείστρου, θαλάμης, κάνης) και φυσιγγίων αυτών. 
β. Εκρηκτικών υλών και εκρηκτικών μηχανισμών. 
γ. Των αναφερόμενων στο άρθρο 2 παρ. 2 παρ. γ' ειδών. 
δ. Όπλων ή άλλων αντικειμένων του άρθρου 1, που προορίζονται για δείγματα ή εκθέσεις, σύμφωνα με τα καθοριζόμενα στην απόφαση, που προβλέπεται από την περίπτωση η' της παραγράφου 2 του άρθρου 2 του παρόντος. 
ε. Όπλων σκοποβολής και ουσιωδών μερών (μηχανισμού κλείστρου, θαλάμης, κάνης) και φυσιγγίων αυτών, καθώς και σκοπευτικών διοπτρών. Η άδεια κατοχής των όπλων αυτών χορηγείται σε φυσικά ή νομικά πρόσωπα, που ασχολούνται αποδεδειγμένα με την προαγωγή του αθλήματος της σκοποβολής. Οι προϋποθέσεις χορήγησης της άδειας κατοχής όπλων σκοποβολής, οι υποχρεώσεις των ενδιαφερόμενων, ο αριθμός των όπλων που επιτρέπεται να κατέχει κάθε φυσικό ή νομικό πρόσωπο και κάθε άλλη αναγκαία λεπτομέρεια, ρυθμίζονται με απόφαση των Υπουργών Πολιτισμού και Δημόσιας Τάξης. 
στ. Αυτόματων όπλων και φυσιγγίων αυτών, που προβλέπονται στις περιπτώσεις του άρθρου 6 παρ. 2 του παρόντος. 
ζ. Των αναφερόμενων στο άρθρο 2, παράγρ. 2 περιπτ. θ' και ι' και 3, όπλων και λοιπών αντικειμένων. 
η. Τόξων και βαλλιστρών προοριζομένων αποκλειστικά και μόνο για σκοποβολή. 
θ. Όπλων και ανενεργών φυσιγγίων αυτών, που αποτελούν ιστορικά ή οικογενειακά κειμήλια ή παρουσιάζουν ιστορικό, αρχαιολογικό ή εθνογραφικό ενδιαφέρον και φυλάσσονται σε συλλογές φυσικών ή νομικών προσώπων. 
3. Για την κατοχή αεροβόλων όπλων και τυφεκίων αλιείας δεν απαιτείται άδεια. Απαγορεύεται η κατοχή τους από άτομα που δεν έχουν συμπληρώσει το 18ο έτος της ηλικίας τους. 
4. Η κατοχή λογχών, ξιφών, ξιφιδίων και ξιφολογχών, απομιμήσεων πυροβόλων όπλων, ως και μη λειτουργούντων πυροβόλων όπλων επιτρέπεται: 
α. Σε πρόσωπα που έχουν άδεια κατοχής όπλων προοριζομένων για συλλογές. 
β. Σε παραγωγούς θεατρικών ή κινηματογραφικών έργων 
5. Δεν απαιτείται άδεια για μαχαίρια, που προορίζονται για αλιεία, θήρα, τέχνη ή οικιακή, επαγγελματική ή άλλη συναφή χρήση, για μηχανισμούς εκτοξεύσεως χημικών ουσιών, που προορίζονται για την ίδια χρήση, ως και για ξίφη και σπάθες που χρησιμοποιούνται για άθληση. 
6. Οι κάτοχοι των ειδών, που αναφέρονται στο άρθρο αυτό, υποχρεούνται να λαμβάνουν τα αναγκαία μέτρα για την ασφαλή φύλαξή τους και να μην παραχωρούν αυτό σε τρίτα πρόσωπα. Οι αρμόδιες αστυνομικές αρχές δύνανται να υποδεικνύουν εγγράφως στους ενδιαφερόμενους τη λήψη των κατά την κρίση τους επιβαλλόμενων μέτρων ασφαλείας. 
7. Όποιος βρίσκει αντικείμενο από τα αναφερόμενα στο άρθρο 1 του παρόντος υποχρεούται να το παραδώσει αμέσως στην πλησιέστερη αστυνομική αρχή ή να ειδοποιήσει αυτή για την παραλαβή του. 
8. α. Με φυλάκιση τουλάχιστον έξι (6) μηνών και χρηματική ποινή τουλάχιστον διακοσίων χιλιάδων (200.000) δραχμών τιμωρούνται οι παραβάτες των παραγράφων 1 και 2, πλην της περιπτ. η' του παρόντος άρθρου. Με την ίδια ποινή τιμωρείται όποιος μετατρέπει ή παραλλάσσει όπλο από τα αναφερόμενα στο άρθρο 1, παράγρ. 1 περιπτ. α' και β' ή απαλείφει ή παραποιεί τον αριθμό του, για οποιονδήποτε σκοπό. 
β. Με φυλάκιση μέχρις ενός (1) έτους τιμωρούνται οι παραβάτες των διατάξεων των παραγράφων 2, περίπτ. η' 3, 4 και 6 του παρόντος άρθρου. 
γ. Οι παραβάτες των διατάξεων της παραγράφου 7 τιμωρούνται με φυλάκιση μέχρι έξι (6) μηνών και, σε περίπτωση που αποσκοπούν σε κατακράτηση των ανευρεθέντων αντικειμένων, με τις ποινές των προηγούμενων εδαφίων, ανάλογα με το είδος του ανευρεθέντος αντικειμένου. 
 
</p>

            </body>
        </html>
        """
        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)


class CourtOrder(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Άρθρο 169Α Π.Κ  - Παραβίαση δικαστικών αποφάσεων και συμφωνιών που επικυρώθηκαν"
                            " από συμβολαιογράφο")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html="""
             <html>
        <head> 
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
            </head>
            <body>
             <h1 style="color:blue; align=center">Άρθρο 169Α Π.Κ  - Παραβίαση δικαστικών αποφάσεων και συμφωνιών που επικυρώθηκαν"
                            " από συμβολαιογράφο</h1>
            <p align: justify;>1. Όποιος δεν συμμορφώθηκε σε προσωρινή διαταγή ή διάταξη δικαστικής απόφασης πολιτικού δικαστηρίου ή 
            σε εισαγγελική διάταξη, που αφορούν τη ρύθμιση της νομής ή της κατοχής, την άσκηση της γονικής μέριμνας, 
            την επικοινωνία με το τέκνο και τη ρύθμιση της χρήσης της οικογενειακής στέγης και της κατανομής των κινητών
             μεταξύ συζύγων ή την απαγόρευση προσέγγισης και επικοινωνίας μεταξύ προσώπων, τιμωρείται με φυλάκιση έως
              τρία (3) έτη ή χρηματική ποινή. Με την ίδια ποινή τιμωρείται και όποιος δεν συμμορφώθηκε σε συμφωνία που 
              επικυρώθηκε από συμβολαιογράφο κατά το άρθρο 1441 του Αστικού Κώδικα και αφορά στην επικοινωνία των 
              ανήλικων τέκνων.2. Με φυλάκιση έως τρία (3) έτη τιμωρείται ο κατηγορούμενος, ο οποίος παραβιάζει τους 
              περιοριστικούς όρους σχετικά με την ελευθερία κίνησης και διαμονής που του έχουν επιβληθεί με δικαστική 
              απόφαση ή με βούλευμα, μετά τη συμπλήρωση του εκάστοτε ανώτατου ορίου της διάρκειας της προσωρινής 
              κράτησης.3. Όποιος εν γνώσει ματαιώνει την εκτέλεση της ποινής ή του μέτρου ασφαλείας που επιβλήθηκε σε
               άλλον τιμωρείται με φυλάκιση έως τρία (3) έτη ή χρηματική ποινή. Η πράξη μένει ατιμώρητη αν ο υπαίτιος
                την τέλεσε υπέρ κάποιου οικείου του.</p>
            </body>
            </html>
        """

        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)


class ObligationLaw(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Άρθρο 358 Π.Κ  - Παραβίαση της υποχρέωσης διατροφής")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html="""
        <head> 
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
            </head>
            <body>
            <h1 style="color:blue; align=center">Άρθρο 358 Π.Κ  - Παραβίαση της υποχρέωσης διατροφής"</h1>
          
        
        <p>Όποιος κακόβουλα παραβιάζει την υποχρέωση διατροφής που την επιβάλει σε αυτόν ο νόμος και έχει αναγνωριστεί,
         έστω προσωρινά, με εκτελεστό τίτλο, με τρόπο τέτοιο ώστε ο δικαιούχος να υποστεί στερήσεις ή να αναγκαστεί 
         να δεχτεί την βοήθεια άλλων, τιμωρείται με φυλάκιση έως ένα έτος ή χρηματική ποινή. Για την ποινική δίωξη
          απαιτείται έγκληση. </p>
        """

        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)


class SoundLaw(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Άρθρο 14 παρ.4 της υπ’ αριθμόν Υ1γ/ΓΠ/47829/17ΥΔ")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html="""
             <html>
        <head> 
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
            </head>
            <body>
             <h1 style="color:blue; align=center">Άρθρο 14  παρ.4 της υπ’ αριθμόν Υ1γ/ΓΠ/47829/17ΥΔ </h1>
            <p align: justify;>Όπως ορίζεται στα άρθρα 2 και 10 της παρούσας, στην κατηγορία αυτή περιλαμβάνονται όλοι 
            οι τύποι επιχειρήσεων μαζικής εστίασης. Η κατηγορία των επιχειρήσεων μαζικής εστίασης ταξινομείται ως 
            ακολούθως:</p>
            <p>Α. ΕΠΙΧΕΙΡΗΣΕΙΣ ΜΑΖΙΚΗΣ ΕΣΤΙΑΣΗΣ: Οι επιχειρήσεις μαζικής εστίασης ταξινομούνται, ανάλογα με τη
             δραστηριότητα τους ως ακολούθως:
             <ol> Επιχειρήσεις μαζικής εστίασης παρασκευής και διάθεσης πλήρους επεξεργασίας, (πλήρους γεύματος).</ol>
             <ol> Επιχειρήσεις μαζικής εστίασης παρασκευής και διάθεσης μερικής επεξεργασίας, (πρόχειρου γεύματος)</ol> 
             Όλες οι επιχειρήσεις της κατηγορίας μαζικής εστίασης, εκτός των γενικών όρων που περιγράφονται στο 
             άρθρο 5, πρέπει να διαθέτουν:
            <ul>Χώρο παραλαβής και αποθήκευσης πρώτων υλών (ξηρή αποθήκη- ψύξη- κατάψυξη) και ειδών συσκευασίας.
            Η παραλαβή και η αποθήκευση των πρώτων υλών να γίνεται σύμφωνα με τον Ε.Κ 852/2004, Κεφ. IX 
            (διατάξεις που εφαρμόζονται στα τρόφιμα). Ο χώρος αποθήκης θα είναι ανάλογος με τη δραστηριότητα της 
            επιχείρησης και τα αποθηκευόμενα είδη, ώστε να αποφεύγεται η διασταυρούμενη επιμόλυνση.</ul>
            <ul>Χώρο επεξεργασίας - μεριδοποίησης και διατήρησης ετοίμων φαγητών (παρασκευαστήριο).
            Για τις επιχειρήσεις προσφοράς πλήρους επεξεργασίας πρέπει ο χώρος να είναι κατάλληλος και επαρκής, ώστε
             να γίνονται ανεμπόδιστα και με ασφάλεια όλοι οι απαιτούμενοι σχετικοί χειρισμοί και να ανταποκρίνεται 
             στη δυναμικότητα της επιχείρησης. Θα υπάρχει ο ανάλογος σε σχέση με τους εκτελούμενους χειρισμούς και τη 
             δυναμικότητα της επιχείρησης αριθμός πάγκων εργασίας, ώστε να διασφαλίζεται ο υγιεινός χειρισμός και ο 
             αποκλεισμός τυχόν διασταυρούμενης επιμόλυνσης τροφίμων. Οι επιχειρήσεις πλήρους επεξεργασίας να διαθέτουν 
             υποχρεωτικά απαγωγικό σύστημα καθώς και οι επιχειρήσεις μερικής επεξεργασίας όπου απαιτείται, (π.χ. 
             λουκουματζίδικα κ.λπ.). Τα προσφερόμενα σε θερμοκρασία περιβάλλοντος προϊόντα, είτε αυτά παρασκευάζονται
              στην ίδια την επιχείρηση είτε σε άλλες νόμιμες επιχειρήσεις, θα διατηρούνται εντός κλειστών προθηκών ή 
              κατάλληλα σκεπασμένα, τυλιγμένα κ.λπ., ώστε σε κάθε περίπτωση να προστατεύονται από τις επιδράσεις του 
              περιβάλλοντος (σκόνη, μύγες, απευθείας έκθεση στον ήλιο) και την ψηλάφηση των πελατών. Οι προθήκες 
              διατήρησης και έκθεσης προϊόντων πρέπει να προστατεύουν πλήρως τα προϊόντα από τις επιδράσεις του 
              περιβάλλοντος (σκόνη, έντομα, απευθείας έκθεση στον ήλιο) και την άμεση πρόσβαση των πελατών σε αυτά.
               Στο χώρο επεξεργασίας πρέπει να υπάρχει και ένας νιπτήρας με παροχή κρύου και ζεστού νερού για το 
               πλύσιμο των χεριών των εργαζομένων που θα λειτουργεί με υγειονομικά αποδεκτό τρόπο, εφοδιασμένος με 
               υγρό σαπούνι για το πλύσιμο των χεριών και καθαρές χειροπετσέτες μιας χρήσης (από χαρτί ή ύφασμα). 
               Να υπάρχει χρωματικός κώδικας εργαλείων κοπής για τα τρόφιμα (π.χ. χρωματισμός μαχαιρών ανάλογα με το 
               τρόφιμο που χρησιμοποιείται). Στις επιχειρήσεις που στο διάγραμμα ροής ή στην αναλυτική περιγραφή της 
               παραγωγικής διαδικασίας προβλέπεται ότι θα υπάρχουν ευαλλοίωτα ενδιάμεσα προϊόντα (σάλτσες, κρέμες, 
               κ.λπ.) θα εξασφαλίζεται ότι υπάρχει στο χώρο προετοιμασίας ανάλογος αριθμός ψυγείων για την ασφαλή 
               αποθήκευσή τους. Αν δεν υπάρχει δυνατότητα ξεχωριστών ψυγείων, να διασφαλίζεται ότι η συναποθήκευση των
                ενδιάμεσων προϊόντων με τις πρώτες ύλες δεν δημιουργεί κίνδυνο διασταυρούμενης επιμόλυνσης τους 
                (κατάλληλη διάκριση των χώρων του ψυγείου για κάθε κατηγορία τροφίμων ή επαρκής διαχωρισμός των χώρων 
                του ψυγείου, αποθήκευση μέσα σε κλειστούς περιέκτες κ.λπ.). Κατά τον ίδιο τρόπο μπορεί να γίνεται και 
                η διατήρηση ορισμένων ζεστών εδεσμάτων για μεταγενέστερη προσφορά. Η μεριδοποίηση προϊόντων πρέπει να 
                γίνεται σε ιδιαίτερο, σαφώς διαχωρισμένο χώρο της επιχείρησης εκτός των περιπτώσεων που από το 
                διάγραμμα ροής προκύπτει ότι μπορεί να γίνεται σε νοητά διαχωρισμένο χώρο του χώρου παρασκευής και 
                επεξεργασίας. Στις επιχειρήσεις του παρόντος άρθρου που παράγουν τυποποιημένα προϊόντα, να υπάρχει 
                επαρκής χώρος για την τυποποίηση. Ο χώρος τυποποίησης θα περιλαμβάνει όλο τον απαραίτητο εξοπλισμό και 
                τα μηχανικά μέσα για τη ρύθμιση κατάλληλων συνθηκών περιβάλλοντος για την επίτευξη της ασφάλειας των 
                τροφίμων. Τα απορρίμματα θα φυλάσσονται προσωρινά σε ειδικά δοχεία επαρκούς χωρητικότητας από 
                κατάλληλο υλικό, ώστε να καθαρίζονται και να απολυμαίνονται αποτελεσματικά. Το κάλυμμα των δοχείων θα 
                είναι στεγανό και θα ανοίγει με ποδοκίνητο μηχανισμό.</ul>
                <ul>Χώρο πλύσεως σκευών/τροφίμων. Ο χώρος πλύσεως σκευών θα είναι ανάλογος των παρασκευαζομένων 
                τροφίμων και των σκευών που χρησιμοποιούνται, σε θέση που να αποφεύγεται η διασταυρούμενη επιμόλυνση.
                 Ο αριθμός λεκανών πλύσης τροφίμων ή σκευών θα είναι επαρκής σε συνδυασμό και με την ύπαρξη ή μη 
                 πλυντηρίου ώστε να ανταποκρίνεται στο κύκλο εργασιών της επιχείρησης. Θα υπάρχει επαρκής εξοπλισμός 
                 για τη στράγγιση και το στέγνωμα, εκτός από τα είδη που στεγνώνουν στο πλυντήριο. Τα στεγνά σκεύη 
                 τοποθετούνται σε κλειστά ντουλάπια, ερμάρια κλπ, που πρέπει να είναι επαρκή για το σκοπό αυτό.
                 Για την πλύση τροφίμων και σκευών για την πρόχειρη επεξεργασία τροφίμων ενδείκνυται να υπάρχει ένα
                 διπλό σύστημα νεροχυτών ή ένας νεροχύτης και πλυντήριο. Για την πλύση τροφίμων και σκευών για την 
                 πλήρης επεξεργασία τροφίμων ενδείκνυται να υπάρχει ένα τετραπλό σύστημα νεροχυτών ή ένα τριπλό 
                 σύστημα νεροχυτών και πλυντήριο.</ul>
                 <ul>Αίθουσα πελατών. Οι επιχειρήσεις μαζικής εστίασης που διαθέτουν αίθουσα πελατών ή και υπαίθριο 
                 (κοινόχρηστο ή ιδιόκτητο) χώρο για εξυπηρέτηση καθήμενων πελατών η μέγιστη δυναμικότητά τους σε 
                 καθήμενα εξυπηρετούμενα άτομα προκύπτει ως ακολούθως: Για την αίθουσα πελατών από τη διαίρεση του 
                 εμβαδού του ωφέλιμου χώρου δια του 1.30 τ.μ. (ως ωφέλιμος χώρος νοείται ο χώρος ο οποίος προσφέρεται
                  για την ανάπτυξη τραπεζοκαθισμάτων). Για τον υπαίθριο χώρο από τη διαίρεση του εμβαδού του υπαίθριου
                   χώρου που νομίμως θα χρησιμοποιηθεί δια του 0,70 τ.μ. Η δυναμικότητα των καθήμενων πελατών αφορά, 
                   το συνολικό αριθμό για την αίθουσα πελατών και τον εξωτερικό χώρο. Δε συνιστά παράβαση η επιμέρους 
                   υπέρβαση της δυναμικότητας των επιμέρους χώρων εάν δεν υφίσταται υπέρβαση επί της συνολικής
                    δυναμικότητας του καταστήματος. Ο συνολικός αριθμός των εξυπηρετούμενων καθήμενων ατόμων και ο 
                    συνολικός αριθμός γευμάτων καθορίζει τη δυναμικότητα της επιχείρησης σύμφωνα με την οποία 
                    ορίζονται και οι απαιτούμενοι κύριοι και βοηθητικοί χώροι αυτών. Στα κυλικεία εντός των 
                    Νοσηλευτικών Ιδρυμάτων με αίθουσα ή χωρίς αίθουσα πελατών δύναται η πώληση και άλλων χρήσιμων 
                    στους ασθενείς ειδών, όπως: κολόνιες, σαπούνια, χαρτομάντιλα, χαρτοβάμβακα, πάνες, υποσέντονα, 
                    κ.τ.ομ υπό την προϋπόθεση ότι τα είδη αυτά θα καταλαμβάνουν ιδιαίτερο νοητό χώρο στο κυλικείο έτσι
                  ώστε να διασφαλίζεται η Δημόσια Υγεία.
                <ol>Στεγασμένοι ή και Υπαίθριοι χώροι Εκδηλώσεων. Στεγασμένοι ή και υπαίθριοι χώροι εκδηλώσεων είναι οι
                 χώροι στους οποίους κατά τη διάρκεια πάσης φύσεως εκδηλώσεων προσφέρονται τρόφιμα ή και ποτά τα οποία 
                 παρασκευάζονται και προετοιμάζονται στα παρασκευαστήρια των χώρων αυτών ή σε άλλους χώρους που 
                 διαθέτουν την απαιτούμενη γνωστοποίηση λειτουργίας (catering κ.λπ.) και μεταφέρονται στους εν λόγω 
                 χώρους για σερβίρισμα και τελική διάθεση. Οι χώροι αυτοί υπάγονται στο καθεστώς γνωστοποίησης 
                 λειτουργίας, σύμφωνα με την ισχύουσα Νομοθεσία ως Στεγασμένοι ή Υπαίθριοι χώροι εκδηλώσεων. Τα
                  δικαιολογητικά που απαιτούνται, είναι όμοια με αυτά που υποβάλλονται, στην αρμόδια αρχή, για τις 
                  επιχειρήσεις τροφίμων και ποτών. Για τους στεγασμένους χώρους εκδηλώσεων, εκτός σχεδίου ή εντός 
                  οικισμού κ.λπ. στις ανωτέρω ιδρυόμενες επιχειρήσεις τροφίμων και ποτών, αντί της βεβαίωσης χρήσεως γης 
                  θα προσκομίζεται η βεβαίωση νομιμότητας της κατασκευής της οικοδομής, του ειδικού κτιρίου, η οποία 
                  έχει εκδοθεί από την αρμόδια πολεοδομική υπηρεσία καθώς και η βεβαίωση χώρου κυρίας χρήσεως. Για τους 
                  υπαίθριους χώρους αυτών των επιχειρήσεων θα προσκομίζεται βεβαίωση νομιμότητας ή τακτοποίησης των 
                  βοηθητικών χώρων και των αποχωρητηρίων. Οι βοηθητικοί χώροι των εν λόγω επιχειρήσεων είναι ανάλογοι με
                   τους προβλεπόμενους στους γενικούς όρους της παρούσας.</p>
                <p>Παραλαβή ετοίμων φαγητών ποτών. θα πρέπει να εξασφαλίζεται ότι οι συνεργαζόμενες επιχειρήσεις 
                τροφίμων και ποτών είναι γνωστοποιημένες σύμφωνα με την ισχύουσα Νομοθεσία.
Τα αυτοκίνητα μεταφοράς τροφίμων πρέπει να πληρούν τους όρους της ισχύουσας νομοθεσίας, να διαθέτουν την προβλεπόμενη
 βεβαίωση καταλληλότητας και να πραγματοποιούν τη μεταφορά σύμφωνα με τα οριζόμενα από την ισχύουσα Νομοθεσία (συνθήκες 
 θερμοκρασίας, χρόνος μεταφοράς κ.τ.λ.). Στους υπαίθριους χώρους εκδηλώσεων η διατήρηση των τροφίμων και ποτών μπορεί να
  γίνεται σε κατάλληλο τροχήλατο ή αυτοκινούμενο εξοπλισμό όπου θα υπάρχει νιπτήρας για το πλύσιμο των χεριών με 
  κατάλληλη υδραυλική εγκατάσταση και μία λεκάνη για το πλύσιμο των σκευών σερβιρίσματος. Σε κάθε περίπτωση, θα πρέπει 
  να πληρούνται οι όροι υγιεινής και ασφάλειας των τροφίμων και ειδικά η διατήρηση σταθερής θερμοκρασίας. Τα παραπάνω θα
   τεκμηριώνονται με καταγραφικά μηχανήματα ή χειρόγραφη καταγραφή.</p>
   <p>Διάθεση- σερβίρισμα. Κατά την τελική διάθεση των έτοιμων τροφίμων και ποτών στο χώρο της εκδήλωσης θα πρέπει να 
   διασφαλίζεται, κατά το δυνατό, ότι αυτά είναι προστατευμένα από τις επιδράσεις του περιβάλλοντος στο οποίο 
   διαθέτονται (κλειστά δοχεία, κλειστές προθήκες, υπό ψύξη κ.τ.λ.). Τα σκεύη σερβιρίσματος θα πρέπει να είναι κατάλληλα
    και επαρκή (π.χ. ξεχωριστή λαβίδα για κάθε είδος προσφερόμενου τροφίμου). Η διαδικασία σερβιρίσματος, στο χώρο 
    έκθεσης των τροφίμων (μπουφές), πρέπει να επιβλέπεται από το προσωπικό, ώστε να διασφαλίζεται η υγιεινή και
     ασφάλεια των προσφερόμενων τροφίμων.</p>
<p>Αίθουσα πελατών - υπαίθριος χώρος. Τα τραπέζια και τα καθίσματα διατηρούνται σε καλή κατάσταση και καθαρά, καθώς
 επίσης και τα τραπεζομάντηλα, τα πιάτα, τα ποτήρια κ.λπ. Δε θα πρέπει να γίνεται σερβίρισμα σε πιάτα ή ποτήρια που 
 έχουν ρωγμές και δεν είναι λεία. Όταν χρησιμοποιούνται σκεύη μιας χρήσης, θα πρέπει να διασφαλίζεται ότι το υλικό από 
 το οποίο είναι κατασκευασμένα (π.χ. πλαστικό, κ.α) είναι κατάλληλο για το σερβίρισμα ζεστών τροφίμων ή ροφημάτων.</p>
<p>Χώρος πλύσεως σκευών. Εάν γίνεται πλύση σκευών, θα πρέπει να υπάρχει επαρκής χώρος για την πλύση των σκευών, των 
εργαλείων και των εξαρτημάτων του εξοπλισμού καθώς και των ειδών εστίασης (πιάτα, ποτήρια κ.λπ.), ανάλογος με τη 
δραστηριότητα της επιχείρησης.
</p>
            </body>
            </html>
        """

        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)

class HarmLaw(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Σωματικές Βλάβες")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html="""
             <html>
        <head> 
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
            </head>
            <body>
             <h1 style="color:blue; align=center">Άρθρο 308 Π.Κ (Νόμος 4619/2019) - Σωματική βλάβη</h1>
            <p align: justify;> 
              <ol>
            <li>Όποιος προξενεί σε άλλον σωματική κάκωση ή βλάβη της υγείας του τιμωρείται με φυλάκιση έως δύο (2) έτη 
            ή χρηματική ποινή. Αν η κάκωση ή βλάβη της υγείας που του προξένησε είναι εντελώς ελαφρά, τιμωρείται με
             χρηματική ποινή ή παροχή κοινωφελούς εργασίας.</li>
             <li>Για τη δίωξη της πράξης της προηγούμενης παραγράφου απαιτείται έγκληση, εκτός αν ο παθών είναι 
             υπάλληλος και η πράξη τελέσθηκε κατά την εκτέλεση της υπηρεσίας του ή για λόγους σχετικούς με την εκτέλεσή 
             της ή υπάλληλος του πλειστηριασμού κατά τη διαδικασία της αναγκαστικής εκτέλεσης και η πράξη τελέσθηκε με
              αφορμή τον πλειστηριασμό, οπότε η δίωξη είναι αυτεπάγγελτη.</li>
              <li> Η σωματική βλάβη της παρ. 1 δεν είναι άδικη, όταν επιχειρείται με τη συναίνεση του παθόντος και δεν 
              προσκρούει στα χρηστά ήθη.</li>
              <li>Ο υπαίτιος της πράξης της παρ. 1 είναι δυνατό να απαλλαγεί από κάθε ποινή αν παρασύρθηκε στην πράξη 
              από δικαιολογημένη αγανάκτηση, εξαιτίας μιας αμέσως προηγούμενης πράξης που τέλεσε ο παθών εναντίον του ή 
              ενώπιόν του και που ήταν ιδιαίτερα σκληρή ή βάναυση.</li>
              </ol>
                </p>
            <h1 style="color:blue; align=center">Άρθρο 309 Π.Κ (Νόμος 4619/2019) - Επικίνδυνη Σωματική βλάβη</h1>
           <p align: justify;> 
            Αν η πράξη του προηγούμενου άρθρου τελέστηκε με τρόπο που μπορούσε να προκαλέσει στον παθόντα κίνδυνο
            ζωής ή βαριά σωματική βλάβη, επιβάλλεται φυλάκιση έως τρία (3) έτη.
            </p>
            <h1 style="color:blue; align=center">Άρθρο 310 Π.Κ (Νόμος 4619/2019) - Βαριά Σωματική βλάβη</h1>
             <p align: justify;> 
            <ol>
            <li>Αν η πράξη του άρθρου 308 είχε ως επακόλουθο τη βαριά σωματική βλάβη επιβάλλεται φυλάκιση τουλάχιστον ε
            νός (1) έτους.</li>
            <li>Όποιος προκαλεί σε άλλον βαριά σωματική βλάβη τιμωρείται με φυλάκιση τουλάχιστον δύο (2) ετών. Αv 
            επιδίωκε την πρόκληση της βαριάς σωματικής βλάβης, τιμωρείται με κάθειρξη.</li>
            <li>Βαριά σωματική βλάβη υπάρχει ιδίως αν η πράξη προξένησε στον παθόντα κίνδυνο ζωής ή βαριά και
             μακροχρόνια αρρώστια ή σοβαρό ακρωτηριασμό ή αναπηρία ή μόνιμη παραμόρφωση ή αν τον εμπόδισε σημαντικά και 
             για πολύ χρόνο να χρησιμοποιεί το σώμα ή τη διάνοιά του.</li>
             <ol></p>
              <h1 style="color:blue; align=center">Άρθρο 311 Π.Κ (Νόμος 4619/2019) - Θανατηφόρα Σωματική βλάβη</h1>
              <p>Αν η σωματική βλάβη είχε επακόλουθο το θάνατο του παθόντος, επιβάλλεται κάθειρξη έως δέκα έτη. Αν ο 
              υπαίτιος επιδίωκε τη βαριά σωματική βλάβη του παθόντος επιβάλλεται κάθειρξη.</p>
              <h1 style="color:blue; align=center">Άρθρο 312 Π.Κ (Νόμος 4619/2019) -Σωματική βλάβη Αδυνάμων Ατόμων</h1>
              <ol>
              <li>Όποιος προκαλεί σωματική κάκωση ή βλάβη της υγείας σε ανήλικο ή σε πρόσωπο που δεν μπορεί να 
              υπερασπίσει τον εαυτό του, εφόσον τα πρόσωπα αυτά βρίσκονται υπό την επιμέλεια ή την προστασία του δράστη 
              βάσει νόμου, δικαστικής απόφασης ή πραγματικής κατάστασης, συνοικούν με τον δράστη ή έχουν μαζί του σχέση
               εργασίας ή υπηρεσίας, τιμωρείται: α) για την πράξη του άρθρου 308 παρ. 1 εδάφιο α΄, με φυλάκιση 
               τουλάχιστον ενός έτους, β) για την πράξη του άρθρου 309, με φυλάκιση τουλάχιστον δύο ετών, γ) για την
                πράξη του άρθρου 310 παρ. 1 εδ. α΄, με φυλάκιση τουλάχιστον τριών ετών και αν επεδίωκε την πρόκληση 
                βαριάς σωματικής βλάβης, με κάθειρξη και δ) για την πράξη του άρθρου 311, με κάθειρξη.</li>
            <li>Οι ίδιες ποινές επιβάλλονται όταν η πράξη τελείται σε βάρος συζύγου κατά τη διάρκεια του γάμου ή σε 
            βάρος συντρόφου κατά τη διάρκεια της συμβίωσης. Η τέλεση της πράξης σε βάρος εγκύου συνιστά επιβαρυντική
             περίπτωση.</li>
             <li>Με την πρόκληση σωματικής βλάβης σε βάρος ανηλίκου κατά την παράγραφο 1 στοιχείο α΄ εξομοιώνεται και η
              τέλεση των πράξεων των προηγούμενων παραγράφων ενώπιον ανηλίκου.</li>
              <li>Με την πρόκληση σωματικής βλάβης κατά την παράγραφο 1 στοιχείο γ΄ εξομοιώνεται και η μεθοδευμένη 
              πρόκληση έντονου σωματικού πόνου ή σωματικής εξάντλησης επικίνδυνης για την υγεία, ή ψυχικού πόνου ικανού 
              να επιφέρει σοβαρή ψυχική βλάβη, ιδίως με την παρατεταμένη απομόνωση σε βάρος των προσώπων της πρώτης 
              παραγράφου./li>
              </ol>
              
            
            
            </body>
            </html>
        """

        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)


class DomesticLaw(QWidget):
    def __init__(self):
        super().__init__()
        self.setWindowTitle("Νομοθεσία Περι Ενδοοικογενειακής Βίας")
        self.setGeometry(200, 200, 600, 400)

        layout = QVBoxLayout()
        bio_text = QTextBrowser()
        bio_html = """
             <html>
        <head> 
            <style>
                body { font-family: Arial, sans-serif; margin: 20px; }
                h1 { color: #2c3e50; }
                p { line-height: 1.6; }
            </style>
            </head>
            <body>
             
             <a href="https://www.kodiko.gr/nomothesia/document/154457/nomos-3500-2006">Νομοθεσία Περι Ενδοοικογενειακής
              Βίας</a>



            </body>
            </html>
        """

        bio_text.setHtml(bio_html)
        layout.addWidget(bio_text)
        self.setLayout(layout)



